Itheum/bluzDK-firmware_wip/platform/MCU/NRF51/SPARK_Firmware_Driver/src/client_handling.c
/*
 * Copyright (c) 2012 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is confidential property of Nordic Semiconductor. The use,
 * copying, transfer or disclosure of such information is prohibited except by express written
 * agreement with Nordic Semiconductor.
 *
 */

#include "client_handling.h"
#include <string.h>
#include <stdbool.h>
#include "nrf.h"
#include "app_error.h"
#include "nrf_gpio.h"
#include "app_trace.h"
#include "ble_db_discovery.h"
#include "ble_srv_common.h"
#include "ble_hci.h"
#include "nrf_delay.h"
#include "spi_slave_stream.h"
#include "app_uart.h"
#include "registered_data_services.h"

#include "debug.h"

#define MULTILINK_PERIPHERAL_BASE_UUID {{0xB2, 0x2D, 0x14, 0xAA, 0xB3, 0x9F, 0x41, 0xED, 0xB1, 0x77, 0xFF, 0x38, 0xD8, 0x17, 0x1E, 0x87}};
#define BLE_SCS_UUID_SERVICE 0x0223
#define BLE_SCS_UUID_DATA_DN_CHAR 0x0224
#define BLE_SCS_UUID_DATA_UP_CHAR 0x0225
// #define BLE_WGT_UUID_SERVICE 0x1810
// #define BLE_WGT_UUID_DATA_UP_CHAR 0x2A35

#define RX_BUFFER_SIZE 					  512

bool waitForTxComplete = true;

/**@brief Client states. */
typedef enum
{
    IDLE,                                           /**< Idle state. */
    STATE_SERVICE_DISC,                             /**< Service discovery state. */
    STATE_NOTIF_ENABLE,                             /**< State where the request to enable notifications is sent to the peer. . */
    STATE_RUNNING,                                  /**< Running state. */
    STATE_ERROR                                     /**< Error state. */
} client_state_t;

/**@brief Client context information. */
typedef struct
{
    ble_db_discovery_t           srv_db;            /**< The DB Discovery module instance associated with this client. */
    dm_handle_t                  handle;            /**< Device manager identifier for the device. */
    uint8_t                      up_char_index;        /**< Client characteristics index in discovered service information. */
    uint8_t                      dn_char_index;        /**< Client characteristics index in discovered service information. */
    uint8_t                      state;             /**< Client state. */
    uint8_t                      ble_read_buffer[RX_BUFFER_SIZE];
    uint16_t                     ble_read_buffer_length;
    uint8_t                      id;
    bool                         socketedParticle;
    bool                         peripheralConnected;
} client_t;

static client_t         m_client[MAX_CLIENTS];      /**< Client context information list. */
static uint8_t          m_client_count;             /**< Number of clients. */
// static uint8_t          m_base_uuid_type;           /**< UUID type. */

static void blink_led(int count)
{
	for (int i = 0; i < count; i++) {
		nrf_gpio_pin_set(GATEWAY_NOTIFICATION_LED);
		nrf_delay_us(100000);
		nrf_gpio_pin_clear(GATEWAY_NOTIFICATION_LED);
		nrf_delay_us(100000);
	}
	// nrf_delay_us(300000);
	nrf_delay_us(100000);
}

static void spi_slave_set_tx_buffer(client_t * p_client, gateway_function_t type, uint8_t * data, uint16_t len)
{
    data[0] = (( (len-SPI_HEADER_SIZE-BLE_HEADER_SIZE) & 0xFF00) >> 8);
    data[1] = ( (len-SPI_HEADER_SIZE-BLE_HEADER_SIZE) & 0xFF);
    data[2] = p_client->id;

    tx_callback(data, len);
}

void debugHelper(char *str)
{
  unsigned char buffer[128];
  client_t p_client;
  unsigned short len;
  p_client.id = 0;

  memset(buffer, 0, 3);
  buffer[3] = CUSTOM_DATA_SERVICE;
  buffer[4] = (((SPI_BUS_CONNECT << 4) & 0xF0) | (0 & 0x0F));

  len = strlen(str) + 1;
  if(len > 122)
  {
    len = 122;
  }
  memcpy(&buffer[5], str, len);
  buffer[5+len] = '\0';

  spi_slave_set_tx_buffer(&p_client, SPI_BUS_DATA, buffer, len+5);
}

void debugHexHelper(unsigned char *data, unsigned short len)
{
  unsigned char buffer[128];
  unsigned short bufLen;
  client_t p_client;
  p_client.id = 0;

  memset(buffer, 0, 3);
  buffer[3] = CUSTOM_DATA_SERVICE;
  buffer[4] = (((SPI_BUS_CONNECT << 4) & 0xF0) | (0 & 0x0F));

  //Build the data hex string.
  bufLen = 0;
  for(int i = 0; i < len; i++)
  {
    bufLen += sprintf(&buffer[5+bufLen], "%02X", data[i]);
    if(bufLen > 122)
    {
      buffer[121] = '\0';
      bufLen = 122;
      break;
    }
  }

  buffer[bufLen + 5] = '\0'; // new

  spi_slave_set_tx_buffer(&p_client, SPI_BUS_DATA, buffer, bufLen+5);
}

/**@brief Function for finding client context information based on handle.
 *
 * @param[in] conn_handle  Connection handle.
 *
 * @return client context information or NULL upon failure.
 */
static uint32_t client_find(uint16_t conn_handle)
{
    uint32_t i;

    for (i = 0; i < MAX_CLIENTS; i++)
    {
        if (m_client[i].srv_db.conn_handle == conn_handle)
        {
            return i;
        }
    }

    return MAX_CLIENTS;
}


/**@brief Function for service discovery.
 *
 * @param[in] p_client Client context information.
 */
static void service_discover(client_t * p_client)
{
    uint32_t   err_code;

    p_client->state = STATE_SERVICE_DISC;

    err_code = ble_db_discovery_start(&(p_client->srv_db),
                                      p_client->srv_db.conn_handle);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling enabling notifications.
 *
 * @param[in] p_client Client context information.
 */
static void notif_enable(client_t * p_client)
{
    uint32_t                 err_code;
    ble_gattc_write_params_t write_params;
    uint8_t                  buf[BLE_CCCD_VALUE_LEN];

    p_client->state = STATE_NOTIF_ENABLE;

    // buf[0] = BLE_GATT_HVX_NOTIFICATION;
    buf[0] = BLE_GATT_HVX_INDICATION;
    buf[1] = 0;

    write_params.write_op = BLE_GATT_OP_WRITE_REQ;
    write_params.handle   = p_client->srv_db.services[0].charateristics[p_client->dn_char_index].cccd_handle;
    write_params.offset   = 0;
    write_params.len      = sizeof(buf);
    write_params.p_value  = buf;

    err_code = sd_ble_gattc_write(p_client->srv_db.conn_handle, &write_params);
    APP_ERROR_CHECK(err_code);

    char msg[64];
    snprintf(msg, 64, "\n******** notif_enable done - err_code = %lu, hd %X\n", (unsigned long)err_code, p_client->srv_db.services[0].charateristics[p_client->dn_char_index].cccd_handle);
    debugHelper(msg);

    snprintf(msg, 64, "\n******** char.uuid. %X\n", p_client->srv_db.services[0].charateristics[p_client->dn_char_index].characteristic.uuid.uuid);
    debugHelper(msg);
}



/**@brief Funtion for sending data to the client
 *
 * @param[in] data  Data to be sent to the client.
 * @param[in] len   Lengthof the data to be sent to the client.
 */
void on_write(client_t * p_client, ble_evt_t * p_ble_evt)
{
	ble_gatts_evt_write_t * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;

	for (int i = 0; i < p_evt_write->len; i++) {
        p_client->ble_read_buffer[p_client->ble_read_buffer_length+i] = p_evt_write->data[i];
	}
    p_client->ble_read_buffer_length += p_evt_write->len;

	if (p_evt_write->len == 2 && p_evt_write->data[0] == 0x03 && p_evt_write->data[1] == 0x04) {
		//got the EOS characters, write this to UART
		spi_slave_set_tx_buffer(p_client, SPI_BUS_DATA, p_client->ble_read_buffer, p_client->ble_read_buffer_length);
        p_client->ble_read_buffer_length = SPI_HEADER_SIZE;
	}
}

/**@brief Funtion for sending data to the client
 *
 * @param[in] data  Data to be sent to the client.
 * @param[in] len   Lengthof the data to be sent to the client.
 */
void client_send_data(uint8_t *data, uint16_t len)
{
    while (len > 0) {
        int chunkLength = (data[0] << 8) | data[1];
        int id = data[2];

        int err_code = 0;
        ble_gattc_write_params_t write_params;
        uint8_t buffer[20];

        int actualBytesSent = 0;

