Itheum/bluzDK-firmware_wip/platform/MCU/NRF51/SPARK_Firmware_Driver/src/client_handling.c
        int formattedLength = chunkLength + BLE_HEADER_SIZE;
        DEBUG("Sending data of size %d", formattedLength);
        for (int i = 0; i < formattedLength; i += 20) {
            uint16_t size = (formattedLength - i > 20 ? 20 : formattedLength - i);
            actualBytesSent += size;
            memcpy(buffer, data + i + SPI_HEADER_SIZE, size);
            DEBUG("Sending packaet of size %d", size);
            write_params.write_op = BLE_GATT_OP_WRITE_CMD;
            write_params.handle = m_client[id].srv_db.services[0].charateristics[m_client[id].up_char_index].characteristic.handle_value;
            write_params.offset = 0;
            write_params.len = size;
            write_params.p_value = buffer;

            err_code = sd_ble_gattc_write(m_client[id].srv_db.conn_handle, &write_params);
            while (err_code == BLE_ERROR_NO_TX_BUFFERS) {
                uint8_t bufferCount = 0;
                //8000 chunks of 500 microseconds is 4 seconds, the longest this should possibly take
                int timeout = 8000;
                while (timeout-- > 0 && waitForTxComplete) {
                    sd_ble_tx_buffer_count_get(&bufferCount);
                    nrf_delay_us(500);
                }
                waitForTxComplete = true;
                err_code = sd_ble_gattc_write(m_client[id].srv_db.conn_handle, &write_params);
            }
        }

        //now send the EOS characters
        uint8_t eotBuffer[2] = {3, 4};
        write_params.write_op = BLE_GATT_OP_WRITE_CMD;
        write_params.handle = m_client[id].srv_db.services[0].charateristics[m_client[id].up_char_index].characteristic.handle_value;
        write_params.offset = 0;
        write_params.len = 2;
        write_params.p_value = eotBuffer;

        err_code = sd_ble_gattc_write(m_client[id].srv_db.conn_handle, &write_params);
        while (err_code == BLE_ERROR_NO_TX_BUFFERS) {
            int timeout = 8000;
            while (timeout-- > 0 && waitForTxComplete) {
                nrf_delay_us(500);
            }
            waitForTxComplete = true;
            err_code = sd_ble_gattc_write(m_client[id].srv_db.conn_handle, &write_params);
        }
        len-=(chunkLength+SPI_HEADER_SIZE + BLE_HEADER_SIZE);
    }
}


static void db_discovery_evt_handler(ble_db_discovery_evt_t * p_evt)
{
  // Find the client using the connection handle.
  client_t * p_client;
  uint32_t   index;
  bool       is_valid_srv_found = false;

  index = client_find(p_evt->conn_handle);
  p_client = &m_client[index];
  //blink(1);

  if (p_evt->evt_type == BLE_DB_DISCOVERY_COMPLETE)
  {
    char msg[64];
    snprintf(msg, 64, "\n******** db_discovery_evt_handler %d\n", p_evt->params.discovered_db.char_count);
    debugHelper(msg);

    // snprintf(msg, 64, "\n******** T %d %d %d %d %d %d %d \n", BLE_GATTC_EVT_WRITE_RSP, BLE_GATTS_EVT_WRITE, BLE_GATTC_EVT_HVX, BLE_GATTC_EVT_TIMEOUT, BLE_EVT_TX_COMPLETE, BLE_GAP_EVT_DISCONNECTED, BLE_GAP_EVT_CONNECTED);
    // snprintf(msg, 64, "\n******** T %d %d %d %d %d %d %d %d %d %d %d \n", BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP, BLE_GATTC_EVT_REL_DISC_RSP, BLE_GATTC_EVT_CHAR_DISC_RSP, BLE_GATTC_EVT_DESC_DISC_RSP, BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP, BLE_GATTC_EVT_READ_RSP, BLE_GATTC_EVT_CHAR_VALS_READ_RSP, BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST, BLE_GATTS_EVT_SYS_ATTR_MISSING, BLE_GATTS_EVT_HVC, BLE_GATTS_EVT_TIMEOUT);
    // debugHelper(msg);
    //
    // snprintf(msg, 64, "\n******** T %d %d %d %d %d %d %d %d %d %d %d %d \n", SD_BLE_GATTS_SERVICE_ADD, SD_BLE_GATTS_INCLUDE_ADD, SD_BLE_GATTS_CHARACTERISTIC_ADD, SD_BLE_GATTS_DESCRIPTOR_ADD, SD_BLE_GATTS_VALUE_SET, SD_BLE_GATTS_VALUE_GET, SD_BLE_GATTS_HVX, SD_BLE_GATTS_SERVICE_CHANGED, SD_BLE_GATTS_RW_AUTHORIZE_REPLY, SD_BLE_GATTS_SYS_ATTR_SET, SD_BLE_GATTS_SYS_ATTR_GET, BLE_GATTS_EVT_SC_CONFIRM);
    // debugHelper(msg);
    //
    // snprintf(msg, 64, "\n******** BLE_UUID_BLOOD_PRESSURE_MEASUREMENT_CHAR. %X\n",BLE_UUID_BLOOD_PRESSURE_MEASUREMENT_CHAR);
    // debugHelper(msg);
    // snprintf(msg, 64, "******** We are in disc_comp type %d.", p_evt->evt_type);
    // debugHelper(msg);
    //
    // msg[0] = 0x01;
    // msg[1] = 0x02;
    // msg[2] = 0x03;
    // debugHexHelper(msg, 3);

    uint8_t i;

    for (i = 0; i < p_evt->params.discovered_db.char_count; i++)
    {
      ble_db_discovery_char_t * p_characteristic;

      p_characteristic = &(p_evt->params.discovered_db.charateristics[i]);

      // if ((p_characteristic->characteristic.uuid.uuid == BLE_SCS_UUID_DATA_DN_CHAR)
      //       &&
      //       (p_characteristic->characteristic.uuid.type == m_base_uuid_type))
      // {
      //   snprintf(msg, 64, "\n******** c_h - FOUND DOWN_CHAR CHAR. i %d\n", i);
      //   debugHelper(msg);
      //
      //   // Characteristic found. Store the information needed and break.
      //   p_client->dn_char_index = i;
      //   is_valid_srv_found = true;
      // }
      // else if ((p_characteristic->characteristic.uuid.uuid == BLE_SCS_UUID_DATA_UP_CHAR)
			//       &&
		  //       (p_characteristic->characteristic.uuid.type == m_base_uuid_type))
			// {
      //     snprintf(msg, 64, "\n******** c_h - FOUND UP_CHAR CHAR\n");
      //     debugHelper(msg);
      //
      //   // Characteristic found. Store the information needed and break.
			// 	p_client->up_char_index = i;
			// 	is_valid_srv_found = true;
			// }



      if ((p_characteristic->characteristic.uuid.uuid == BLE_UUID_BLOOD_PRESSURE_MEASUREMENT_CHAR) // WEIGHT READING
            &&
            (p_characteristic->characteristic.uuid.type == BLE_UUID_TYPE_BLE))
      {
        snprintf(msg, 64, "\n******** c_h - FOUND 0x2A35 CHAR. i %d\n", i);
        debugHelper(msg);

        // Characteristic found. Store the information needed and break.
        p_client->dn_char_index = i;
        is_valid_srv_found = true;
      }
    }
  }

  if (is_valid_srv_found)
  {
      // Enable notification.
      notif_enable(p_client);
  }
  else
  {
      p_client->state = STATE_ERROR;
  }
}


