Itheum/bluzDK-firmware_wip/platform/MCU/NRF51/SPARK_Firmware_Driver/src/client_handling.c
/**@brief Function for setting client to the running state once write response is received.
 *
 * @param[in] p_ble_evt Event to handle.
 */
static void on_evt_write_rsp(ble_evt_t * p_ble_evt, client_t * p_client)
{
    char msg[64];
    snprintf(msg, 64, "\n******** on_evt_write_rsp A");
    debugHelper(msg);

    if ((p_client != NULL) && (p_client->state == STATE_NOTIF_ENABLE))
    {
        if (p_ble_evt->evt.gattc_evt.params.write_rsp.handle !=
            p_client->srv_db.services[0].charateristics[p_client->dn_char_index].cccd_handle)
        {
            snprintf(msg, 64, "\n******** on_evt_write_rsp B");
            debugHelper(msg);

            // Got response from unexpected handle.
            p_client->state = STATE_ERROR;
        }
        else
        {
            snprintf(msg, 64, "\n******** on_evt_write_rsp C");
            debugHelper(msg);

            p_client->state = STATE_RUNNING;
            p_client->peripheralConnected = true;
        }
    }
}


/**@brief Function for toggling LEDS based on received notifications.
 *
 * @param[in] p_ble_evt Event to handle.
 */
static void on_evt_hvx(ble_evt_t * p_ble_evt, client_t * p_client, uint32_t index)
{
  char msg[64];
  snprintf(msg, 64, "\n********  on_evt_hvx\n");
  debugHelper(msg);

  if ((p_client != NULL) && (p_client->state == STATE_RUNNING))
  {
    if (p_ble_evt->evt.gattc_evt.params.hvx.handle ==
          p_client->srv_db.services[0].charateristics[p_client->dn_char_index].characteristic.handle_value)
    {

        // ble_gattc_evt_hvx_t * p_evt_write = &p_ble_evt->evt.gattc_evt.params.hvx;

        snprintf(msg, 64, "\n********  on_evt_hvx IN\n");
        debugHelper(msg);

      //   if (p_evt_write->len == 2 && p_evt_write->data[0] == 0x03 && p_evt_write->data[1] == 0x04)
      //   {
		  //     if ( p_client->peripheralConnected && !p_client->socketedParticle)
      //     {
      //       p_client->socketedParticle = true;
      //
      //       //this is a hack-fx. v1.0.47 of bluz FW didn't properly fill out the connection field of the BLE header, so we have to do it here
      //       p_client->ble_read_buffer[SPI_HEADER_SIZE+1] = ((SPI_BUS_CONNECT << 4) & 0xF0) | (p_client->ble_read_buffer[1] & 0x0F);
      //
      //       // snprintf(msg, 64, "******** c_h - on_evt_hvx - SPI_BUS_CONNECT");
      //       // debugHelper(msg);
      //
      //       spi_slave_set_tx_buffer(p_client, SPI_BUS_CONNECT, p_client->ble_read_buffer, p_client->ble_read_buffer_length);
		  //     }
      //     else
      //     {
      //       unsigned long lenVal = (unsigned long)p_client->ble_read_buffer_length;
      //       //
      //       // snprintf(msg, 64, "\n******** c_h - on_evt_hvx - SPI_BUS_DATA len = %lu\n ", lenVal);
      //       // debugHelper(msg);
      //       //
      //       if (lenVal == 6) {
      //         snprintf(msg, 64, "\n******** THIS IS THE DATA");
      //         debugHelper(msg);
      //
      //         // snprintf(msg, 64, "********START-ble_read_buffer");
      //         // debugHelper(msg);
      //         //
      //         // debugHexHelper(p_client->ble_read_buffer, p_client->ble_read_buffer_length);
      //         //
      //         // snprintf(msg, 64, "********END-ble_read_buffer");
      //         // debugHelper(msg);
      //       }
      //
      //       //got the EOS characters, write this to UART
		  //      spi_slave_set_tx_buffer(p_client, SPI_BUS_DATA, p_client->ble_read_buffer, p_client->ble_read_buffer_length);
      //     }
      //
      //     p_client->ble_read_buffer_length = SPI_HEADER_SIZE;
			// }
      // else
      // {
      //   // snprintf(msg, 64, "******** c_h - on_evt_hvx - else hit");
      //   // debugHelper(msg);
      //
      //   memcpy(p_client->ble_read_buffer+p_client->ble_read_buffer_length, p_evt_write->data, p_evt_write->len);
      //
      //   p_client->ble_read_buffer_length += p_evt_write->len;
			// }
      //
    }
  }
}


/**@brief Function for handling timeout events.
 */
static void on_evt_timeout(ble_evt_t * p_ble_evt, client_t * p_client)
{
    APP_ERROR_CHECK_BOOL(p_ble_evt->evt.gattc_evt.params.timeout.src
                         == BLE_GATT_TIMEOUT_SRC_PROTOCOL);

    if (p_client != NULL)
    {
        p_client->state = STATE_ERROR;
    }
}


ret_code_t client_handling_dm_event_handler(const dm_handle_t    * p_handle,
                                              const dm_event_t     * p_event,
                                              const ret_code_t     event_result)
{
    client_t * p_client = &m_client[p_handle->connection_id];

    switch (p_event->event_id)
    {
       case DM_EVT_LINK_SECURED:
           // Attempt configuring CCCD now that bonding is established.
           if (event_result == NRF_SUCCESS)
           {
               notif_enable(p_client);
           }
           break;
       default:
           break;
    }

    return NRF_SUCCESS;
}


void client_handling_ble_evt_handler(ble_evt_t * p_ble_evt)
{
    client_t * p_client = NULL;
    uint32_t index = client_find(p_ble_evt->evt.gattc_evt.conn_handle);
    if (index != MAX_CLIENTS)
    {
       p_client = &m_client[index];
    }

    char msg[64];
    // snprintf(msg, 64, "\n******** c_h - c_h_b_evt_handler - %lu \n", (unsigned long)index);
    // debugHelper(msg);

    snprintf(msg, 64, "\n******** c_h_b_evt_handler - id %d \n", p_ble_evt->header.evt_id);
    debugHelper(msg);

    switch (p_ble_evt->header.evt_id)
    {
      case BLE_GATTC_EVT_WRITE_RSP:
        snprintf(msg, 64, "\n******** BLE_GATTC_EVT_WRITE_RSP\\n");
        debugHelper(msg);

        if ((p_ble_evt->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_ATTERR_INSUF_AUTHENTICATION) ||
            (p_ble_evt->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_ATTERR_INSUF_ENCRYPTION))
        {
            // uint32_t err_code = dm_security_setup_req(&p_client->handle);
            // APP_ERROR_CHECK(err_code);
            //
            // snprintf(msg, 64, "\n******** ENCRYPTION = %lu\n ", (unsigned long)err_code);
            // debugHelper(msg);
            //
            // snprintf(msg, 64, "\n******** NRF_ERROR_INVALID_STATE A = %lu\n ", (unsigned long)NRF_ERROR_INVALID_STATE);
            // debugHelper(msg);
            //
            // snprintf(msg, 64, "\n******** NRF_ERROR_INVALID_STATE B = %d\n ", NRF_ERROR_INVALID_STATE);
            // debugHelper(msg);

