Itheum/bluzDK-firmware_wip/platform/MCU/NRF51/SPARK_Firmware_Driver/src/client_handling.c
        }
        on_evt_write_rsp(p_ble_evt, p_client);
        break;

      case BLE_GATTS_EVT_WRITE:
      	on_write(p_client, p_ble_evt);
      	break;

      case BLE_GATTC_EVT_HVX:
        on_evt_hvx(p_ble_evt, p_client, index);
        break;

      case BLE_GATTC_EVT_TIMEOUT:
        on_evt_timeout(p_ble_evt, p_client);
        break;

      case BLE_EVT_TX_COMPLETE:
  			waitForTxComplete = false;
  			break;

      case BLE_GAP_EVT_DISCONNECTED:
         break;

      case BLE_GAP_EVT_CONNECTED:
         break;

      default:
          break;
    }


    if (p_client != NULL)
    {
        ble_db_discovery_on_ble_evt(&(p_client->srv_db), p_ble_evt);
    }
}


/**@brief Database discovery module initialization.
 */
static void db_discovery_init(void)
{
    uint32_t err_code = ble_db_discovery_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the client handling.
 */
void client_handling_init(void (*b)(uint8_t *m_tx_buf, uint16_t size))
{
  blink_led(1);
	tx_callback = b;

	uint32_t err_code;
  uint32_t i;

  // ble_uuid128_t base_uuid = MULTILINK_PERIPHERAL_BASE_UUID;
  //
  // err_code = sd_ble_uuid_vs_add(&base_uuid, &m_base_uuid_type);
  // APP_ERROR_CHECK(err_code);

  for (i = 0; i < MAX_CLIENTS; i++)
  {
    m_client[i].state  = IDLE;
  }

  m_client_count = 0;

  db_discovery_init();

  char msg[64];

  // //Register with discovery module for the discovery of the service.
  // ble_uuid_t uuid;
  //
  // uuid.type = m_base_uuid_type;
  // uuid.uuid = BLE_SCS_UUID_SERVICE;
  //
  // err_code = ble_db_discovery_evt_register(&uuid,
  //                                          db_discovery_evt_handler);
  //
  // APP_ERROR_CHECK(err_code);
  //
  // snprintf(msg, 64, "\n******** client_handling_init = %lu %d\n ", (unsigned long)err_code, (unsigned int) uuid.type);
  // debugHelper(msg);

  // Register with discovery module for the discovery of the WEIGHT READING service.
  ble_uuid_t uuid;

  uuid.type = BLE_UUID_TYPE_BLE;
  uuid.uuid = BLE_UUID_BLOOD_PRESSURE_SERVICE;

  err_code = ble_db_discovery_evt_register(&uuid,
                                            db_discovery_evt_handler);

  APP_ERROR_CHECK(err_code);

  snprintf(msg, 64, "\n******** client_handling_init = %lu %d\n ", (unsigned long)err_code, (unsigned int) uuid.type);
  debugHelper(msg);

}

/**@brief Function for returning the current number of clients.
 */
uint8_t client_handling_count(void)
{
    return m_client_count;
}


/**@brief Function for creating a new client.
 */
uint32_t client_handling_create(const dm_handle_t * p_handle, uint16_t conn_handle)
{
    m_client[p_handle->connection_id].ble_read_buffer_length = SPI_HEADER_SIZE;
    m_client[p_handle->connection_id].state              = STATE_SERVICE_DISC;
    m_client[p_handle->connection_id].srv_db.conn_handle = conn_handle;
                m_client_count++;
    m_client[p_handle->connection_id].handle             = (*p_handle);
    m_client[p_handle->connection_id].id                 = p_handle->connection_id;
    m_client[p_handle->connection_id].socketedParticle   = false;
    m_client[p_handle->connection_id].peripheralConnected = false;
    service_discover(&m_client[p_handle->connection_id]);

    return NRF_SUCCESS;

  //   m_client[p_handle->connection_id].state              = STATE_SERVICE_DISC;
  //   m_client[p_handle->connection_id].srv_db.conn_handle = conn_handle;
  //              m_client_count++;
  //  m_client[p_handle->connection_id].handle             = (*p_handle);
  //  service_discover(&m_client[p_handle->connection_id]);
   //
  //  return NRF_SUCCESS;
}

/**@brief Function for freeing up a client by setting its state to idle.
 */
uint32_t client_handling_destroy(const dm_handle_t * p_handle)
{
    uint32_t      err_code = NRF_SUCCESS;
    client_t    * p_client = &m_client[p_handle->connection_id];

    if (p_client->state != IDLE)
    {
        m_client_count--;
        p_client->state = IDLE;
        //first 3 bytes are SPI header, will get filled in by function. next two bytes are BLE header
        uint8_t dummy[6] = {0, 0, 0, SOCKET_DATA_SERVICE, (((SPI_BUS_DISCONNECT << 4) & 0xF0) | (0 & 0x0F)), 22};
        spi_slave_set_tx_buffer(p_client, SPI_BUS_DISCONNECT, dummy, 6);
    }
    else
    {
        err_code = NRF_ERROR_INVALID_STATE;
    }
    return err_code;
}

void disconnect_all_peripherals(void) {
    for (int i = 0; i < MAX_CLIENTS; i++) {
        if (m_client[i].state == STATE_RUNNING) {
            sd_ble_gap_disconnect(m_client[i].srv_db.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        }

    }
}

void connected_peripherals(uint8_t *values) {
    for (int i = 0; i < MAX_CLIENTS; i++) {
        if (m_client[i].state == STATE_RUNNING) {
            values[i] = 1;
        }
        else {
            values[i] = 0;
        }

    }
}
